randread/150_node/job_1471004_fiojob_1/nid00047_fiojob_1/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
fio-3.27
Starting 1 process
test: Laying out IO file (1 file / 1024MiB)

test: (groupid=0, jobs=1): err= 0: pid=148636: Tue Jul 20 11:05:16 2021
  read: IOPS=168, BW=672KiB/s (689kB/s)(197MiB/300008msec)
    slat (usec): min=470, max=75062, avg=5930.49, stdev=4382.03
    clat (usec): min=26, max=1869.8k, avg=1513021.10, stdev=97982.18
     lat (msec): min=13, max=1877, avg=1518.95, stdev=98.10
    clat percentiles (msec):
     |  1.00th=[ 1351],  5.00th=[ 1401], 10.00th=[ 1418], 20.00th=[ 1452],
     | 30.00th=[ 1469], 40.00th=[ 1502], 50.00th=[ 1519], 60.00th=[ 1536],
     | 70.00th=[ 1552], 80.00th=[ 1586], 90.00th=[ 1620], 95.00th=[ 1653],
     | 99.00th=[ 1703], 99.50th=[ 1720], 99.90th=[ 1787], 99.95th=[ 1821],
     | 99.99th=[ 1871]
   bw (  KiB/s): min=   96, max=  840, per=99.78%, avg=671.66, stdev=61.59, samples=597
   iops        : min=   24, max=  210, avg=167.87, stdev=15.40, samples=597
  lat (usec)   : 50=0.01%
  lat (msec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.05%, 500=0.08%
  lat (msec)   : 750=0.10%, 1000=0.09%, 2000=99.66%
  cpu          : usr=0.32%, sys=2.35%, ctx=50447, majf=0, minf=293
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=50435,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=672KiB/s (689kB/s), 672KiB/s-672KiB/s (689kB/s-689kB/s), io=197MiB (207MB), run=300008-300008msec